Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/edc/PIC32MZ0512EFK100.PIC
      <edc:SFRDef edc:_addr="0x1F8E320C" edc:_begin="0x200" edc:_end="0x210" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="7" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA1N" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA1N" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACOUNT" edc:desc="" edc:mask="0xffffffff" edc:name="DMACOUNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3210" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E3214" edc:_begin="0x214" edc:_end="0x220" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="8" edc:access="---------------------nnnnnnnnnnn" edc:cname="USBDMA2C" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="USBDMA2C" edc:nzwidth="32" edc:por="---------------------00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMADIR" edc:desc="" edc:mask="0x1" edc:name="DMADIR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAMODE" edc:desc="" edc:mask="0x1" edc:name="DMAMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAEP" edc:desc="" edc:mask="0xf" edc:name="DMAEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:desc="" edc:mask="0x1" edc:name="DMAERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMABRSTM" edc:desc="" edc:mask="0x3" edc:name="DMABRSTM" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3218" edc:_begin="0x214" edc:_end="0x220" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA2A" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA2A" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E321C" edc:_begin="0x214" edc:_end="0x220" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA2N" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA2N" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACOUNT" edc:desc="" edc:mask="0xffffffff" edc:name="DMACOUNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3220" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E3224" edc:_begin="0x224" edc:_end="0x230" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="9" edc:access="---------------------nnnnnnnnnnn" edc:cname="USBDMA3C" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="USBDMA3C" edc:nzwidth="32" edc:por="---------------------00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMADIR" edc:desc="" edc:mask="0x1" edc:name="DMADIR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAMODE" edc:desc="" edc:mask="0x1" edc:name="DMAMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAEP" edc:desc="" edc:mask="0xf" edc:name="DMAEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:desc="" edc:mask="0x1" edc:name="DMAERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMABRSTM" edc:desc="" edc:mask="0x3" edc:name="DMABRSTM" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3228" edc:_begin="0x224" edc:_end="0x230" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="9" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA3A" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA3A" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E322C" edc:_begin="0x224" edc:_end="0x230" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="9" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBDMA3N" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBDMA3N" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACOUNT" edc:desc="" edc:mask="0xffffffff" edc:name="DMACOUNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3230" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E3234" edc:_begin="0x234" edc:_end="0x240" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="10" edc:access="---------------------nnnnnnnnnnn" edc:cname="USBDMA4C" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="USBDMA4C" edc:nzwidth="32" edc:por="---------------------00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMADIR" edc:desc="" edc:mask="0x1" edc:name="DMADIR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAMODE" edc:desc="" edc:mask="0x1" edc:name="DMAMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAIE" edc:desc="" edc:mask="0x1" edc:name="DMAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAEP" edc:desc="" edc:mask="0xf" edc:name="DMAEP" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:desc="" edc:mask="0x1" edc:name="DMAERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMABRSTM" edc:desc="" edc:mask="0x3" edc:name="DMABRSTM" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
